#Написать программу выводящую число пи. Указание: необходимо использовать математический пакета math. 

import math
s = (math.pi)
print (s)