#Напишите программу, которая вычисляет количество цифр числа. Используйте функцию.

def s(c):
    return len(c)
print(s(input()))