#Напишите функцию, находящую наименьшее из четырех данных чисел.

print(min(input().split()))