#Напишите программу, которая определяет количество различных символов, встречающихся в символьной строке.

a = input()
print(len(set(a)))
